package guigui;

public class LocationData {
     static final String[] cities = { "서울특별시", "부산광역시", "대구광역시", "인천광역시", "광주광역시", "대전광역시", "울산광역시", "경기도", "강원도",
            "충청북도", "충청남도", "전라북도","전라남도","경상북도","경상남도", "제주특별자치도" };
     static final String[] daegu = { "중구", "동구", "서구", "남구", "북구", "수성구", "달서구", "달성군" };
     static final String[] seoul = { "종로구", "중구", "용산구", "성동구", "광진구", "동대문구", "중랑구", "성북구", "강북구", "도봉구",
            "노원구", "은평구", "서대문구", "마포구", "양천구", "강서구", "구로구", "금천구", "영등포구", "동작구", "관악구", "서초구", "강남구", "송파구", "강동구" };
     static final String[] busan = { "중구", "서구", "동구", "영도구", "부산진구", "동래구", "남구", "북구", "강서구", "해운대구",
            "사하구", "금정구", "연제구", "수영구", "사상구", "기장군" };
    static final String[] gwangjoo = { "동구", "서구", "남구", "북구", "광산구" };
    static final String[] daejeon = { "동구", "중구", "서구", "유성구", "대덕구" };
    static final String[] incheon = { "중구", "동구", "미추홀구", "연수구", "남동구", "부평구", "계양구", "서구", "강화군",
            "옹진군" };
    static final String[] ulsan = {"중구", "남구", "동구", "북구", "울주군" };
    static final String[] kyunggi = { "수원", "성남", "안양", "안산", "용인", "광명", "평택", "과천", "오산", "시흥", "군포",
            "의왕", "하남", "이천", "안성", "김포", "화성", "광주", "여주", "부천", "양평", "고양", "의정부", "동두천", "구리", "남양주", "파주", "양주",
            "포천" };
    static final String[] kangwon = {  "춘천", "원주", "강릉", "동해", "태백", "속초", "삼척", "홍천", "횡성", "영월", "평창",
            "정선", "철원", "화천", "양구", "인제", "고성", "양양" };
    static final String[] choongchungnam = { "청주", "충주", "제천", "천안", "공주", "보령", "아산", "서산", "논산", "계룡",
            "당진" };
    static final String[] choongchungbuk = { "청주", "충주", "제천", "천안", "공주", "보령", "아산", "서산", "논산", "계룡",
            "당진" };
    static final String[] jeonranam = {"전주", "군산", "익산", "정읍", "남원", "김제", "목포", "여수", "순천", "나주", "광양" };
    static final String[] jeonrabuk = {"전주", "군산", "익산", "정읍", "남원", "김제", "목포", "여수", "순천", "나주", "광양" };
    static final String[] kyungsangnam = {"창원", "진주", "통영", "사천", "김해", "밀양", "거제", "양산", "의령", "함안", "창녕",
            "고성", "남해", "하동", "산청", "함양", "거창", "합천" };
     static final String[] kyungsangbuk = {"창원", "진주", "통영", "사천", "김해", "밀양", "거제", "양산", "의령", "함안", "창녕",
            "고성", "남해", "하동", "산청", "함양", "거창", "합천" };

     static final String[] jeju = { "----" };// 하위 행정구역으로 시·군·구의 기초자치단체를 두지 않는 단층제 광역자치단체이다. 다만, 행정시의 형태로 제주시와
    // 서귀포시가 있다


}
